Enums/ВидыУпаковокИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыУпаковокИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Логистическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Групповая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Потребительская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизнаяМаркаСНомеромИСерией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгрегированныйТаможенныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемноСортовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЯвляетсяУпаковкой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/УточнениеКоэффициентовУпаковокИСМП/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем КоличествоДоИзменения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Значение Из Перечисления.ВидыУпаковокИС Цикл
		ВидУпаковкиСписокВыбора.Добавить(Значение);
	КонецЦикла;
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресУточнениеКоэффициентовУпаковок) Тогда
		
		ВходящаяТаблицаОписаниеGTIN = ПолучитьИзВременногоХранилища(Параметры.АдресУточнениеКоэффициентовУпаковок);
		Если ВходящаяТаблицаОписаниеGTIN.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствуют данные для уточнения'"),,,, Отказ);
			Возврат;
		КонецЕсли;
		
		ЕстьПодсистемаРаботаСНоменклатурой = ИнтеграцияИС1СНоменклатура.ЕстьПодсистемаРаботаСНоменклатурой();
		ИспользуетсяСервис1СНоменклатура = ИнтеграцияИС1СНоменклатура.СервисДоступен(ЕстьПодсистемаРаботаСНоменклатурой);
		
	ИначеЕсли Параметры.ДанныеПоискаGTIN <> Неопределено Тогда
		
		ПараметрыДанныхУточнения = Новый Структура("ЭтоНастройкаКарточкиНоменклатуры", Параметры.ЭтоНастройкаКарточкиНоменклатуры);
		
		ВходящаяТаблицаОписаниеGTIN = ИнтеграцияИСМП.ДанныеДляУточненияКоэффициентовУпаковок(
			Параметры.ДанныеПоискаGTIN,
			Параметры.ИспользоватьХарактеристики,
			ПараметрыДанныхУточнения);
		
		Если ВходящаяТаблицаОписаниеGTIN.Количество() = 0 Тогда
			ДанныеПредставления = Новый Массив();
			Для Каждого СтрокаДанных Из Параметры.ДанныеПоискаGTIN Цикл
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДанных, "Характеристика") Тогда
					Характеристика = СтрокаДанных.Характеристика;
				КонецЕсли;
				ДанныеПредставления.Добавить(
					ОбщегоНазначенияИС.ПредставлениеНоменклатуры(
						СтрокаДанных.Номенклатура,
						Характеристика));
			КонецЦикла;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(
					НСтр("ru = 'Не найдено ни одного GTIN для %1'"),
					СтрСоединить(ДанныеПредставления, ", ")),,,,
				Отказ);
			Возврат;
		КонецЕсли;
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Неверные параметры открытия формы уточнения коэффициентов упаковок'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ВидПродукции) Тогда
		ВидПродукции = Параметры.ВидПродукции;
	ИначеЕсли ВходящаяТаблицаОписаниеGTIN.Количество() Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВходящаяТаблицаОписаниеGTIN[0], "ВидПродукции") Тогда
			ВидПродукции = ВходящаяТаблицаОписаниеGTIN[0].ВидПродукции;
		ИначеЕсли ЗначениеЗаполнено(ВходящаяТаблицаОписаниеGTIN[0].Номенклатура) Тогда
			ВидПродукции = ОбщегоНазначенияИС.ОписаниеНоменклатуры(
				ВходящаяТаблицаОписаниеGTIN[0].Номенклатура)[ВходящаяТаблицаОписаниеGTIN[0].Номенклатура].КлючВидовПродукции;
		КонецЕсли;
	КонецЕсли;
	
	УточнениеВидаУпаковки = Параметры.УточнениеВидаУпаковки;
	ДоступноРедактированиеВидаУпаковки = УточнениеВидаУпаковки
		Или Параметры.ДоступноРедактированиеВидаУпаковки;
	
	ТолькоПотребительскиеУпаковки = Истина;
	
	НоменклатураИХарактеристики = Новый Массив;
	
	НомерСтроки = 0;
	Для Каждого СтрокаДанных Из ВходящаяТаблицаОписаниеGTIN Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ОписаниеGTIN.Добавить();
		НоваяСтрока.НомерСтроки = НомерСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		
		Если НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
			И НоваяСтрока.КоличествоПотребительскихУпаковок <> 1 Тогда
			НоваяСтрока.КоличествоПотребительскихУпаковок = 1;
		КонецЕсли;
		
		Если НоваяСтрока.Коэффициент = 0 Тогда
			НоваяСтрока.Коэффициент = 1;
		КонецЕсли;
		
		Если НоваяСтрока.КоличествоВПотребительскойУпаковке = 0 Тогда
			НоваяСтрока.КоличествоВПотребительскойУпаковке = 1;
		КонецЕсли;
		
		Если НоваяСтрока.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
			ТолькоПотребительскиеУпаковки = Ложь;
		КонецЕсли;
		
		НоваяСтрока.ДоступноРедактированиеВидаУпаковки = ДоступноРедактированиеВидаУпаковки
			Или Не ЗначениеЗаполнено(СтрокаДанных.ВидУпаковки);
		
		Если ИспользуетсяСервис1СНоменклатура Тогда
			НоменклатураИХарактеристики.Добавить(
				Новый Структура("Номенклатура, Характеристика",
				НоваяСтрока.Номенклатура,
				НоваяСтрока.Характеристика));
		КонецЕсли;
		
	КонецЦикла;
	
	НастроитьЭлементыФормыНаСервере();
	
	Объект = Новый Структура("Номер, Дата", "", ТекущаяДатаСеанса());
	ПараметрыУказанияСерий = ИнтеграцияИС.ПараметрыУказанияСерийФормыОбъекта(Объект, Документы.МаркировкаТоваровИСМП);
	
	// Работа с 1С Номенклатура
	
	Элементы.ОписаниеGTINНоменклатураСервиса.Видимость = ИспользуетсяСервис1СНоменклатура;
	
	Если ИспользуетсяСервис1СНоменклатура Тогда
		
		ПараметрыЗаполнения = ИнтеграцияИС1СНоменклатура.НовыеПараметрыЗаполненияТаблицыСопоставленнойНомеклатуройСервиса();
		ПараметрыЗаполнения.ИмяТаблицы = "ОписаниеGTIN";
		ИнтеграцияИС1СНоменклатура.ЗаполнитьСопоставление1СНоменклатураПоСсылкамВТаблице(НоменклатураИХарактеристики, ЭтотОбъект, ПараметрыЗаполнения);
		
	КонецЕсли;
	
	НастроитьЭлементыСопоставлениеНоменклатурыПоДаннымСервисаПриСоздании();
	НастроитьФормуПриДлительнойОперации(Ложь, "");
	
	ИнтеграцияИСПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, ОписаниеGTIN);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	СобытияФормИСМПКлиентПереопределяемый.ОбработкаВыбораСерии(
		ЭтотОбъект, ВыбранноеЗначение, ИсточникВыбора, ПараметрыУказанияСерий);
	
	СобытияФормИСМПКлиентПереопределяемый.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИспользуетсяСервис1СНоменклатура Тогда
		Штрихкоды = ШтрихкодыНоменклатурыКОпределению();
		ПолучитьНоменклатуруПоШтрихкодамВСервисе(Штрихкоды);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОписаниеGTIN

&НаКлиенте
Процедура ОписаниеGTINВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ОписаниеGTINНоменклатураСервиса
		И ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторНоменклатуры) Тогда
		ОткрытьКарточку1СНоменклатура(ТекущиеДанные);
	ИначеЕсли УточнениеВидаУпаковки Тогда
		СобытияФормИСМПКлиент.ВыборЭлементаТабличнойЧастиОткрытьФормуЭлемента(ЭтотОбъект, Элемент, Поле);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINПриАктивизацииЯчейки(Элемент)
	
	Потребительская = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская");
	Групповая       = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая");
	Набор           = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор");
	Логистическая   = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая");
	
	ПредставлениеВидовУпаковок = ПредставлениеВидовУпаковокПоВидуПродукции(ЭтотОбъект, ВидПродукции);
	Если ПредставлениеВидовУпаковок.Количество() = 0 Тогда
		ПредставлениеВидовУпаковок.Вставить(Потребительская, НСтр("ru = 'Потребительская'"));
		ПредставлениеВидовУпаковок.Вставить(Групповая,       НСтр("ru = 'Групповая'"));
		ПредставлениеВидовУпаковок.Вставить(Набор,           НСтр("ru = 'Набор'"));
		ПредставлениеВидовУпаковок.Вставить(Логистическая,   НСтр("ru = 'Логистическая'"));
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент = Элементы.ОписаниеGTINВидУпаковки Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			
			ДоступенЛюбойВидУпаковки = Не ЗначениеЗаполнено(ТекущиеДанные.Упаковка);
			ЭтоПотребительскаяУпаковка = ТекущиеДанные.Коэффициент / ТекущиеДанные.КоличествоВПотребительскойУпаковке = 1;
			
			ИспользуютсяНаборы = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетНаборы(
				ТекущиеДанные.ВидПродукции);
			ИспользуютсяГрупповыеУпаковки = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетГрупповыеУпаковки(
				ТекущиеДанные.ВидПродукции);
			
			СписокВыбора = Новый СписокЗначений;
			СписокВыбора.Добавить(
				Потребительская,
				ПредставлениеВидовУпаковок[Потребительская]);
			Если ИспользуютсяГрупповыеУпаковки Тогда
				СписокВыбора.Добавить(
					Групповая,
					ПредставлениеВидовУпаковок[Групповая]);
			КонецЕсли;
			Если ИспользуютсяНаборы Тогда
				СписокВыбора.Добавить(
					Набор,
					ПредставлениеВидовУпаковок[Набор]);
			КонецЕсли;
			СписокВыбора.Добавить(
				Логистическая,
				ПредставлениеВидовУпаковок[Логистическая]);
			
			Элементы.ОписаниеGTINВидУпаковки.СписокВыбора.Очистить();
			Для Каждого ЭлементСписка Из СписокВыбора Цикл
				
				Если ДоступенЛюбойВидУпаковки
					Или ЭлементСписка.Значение = Набор
					Или ЭтоПотребительскаяУпаковка = (ЭлементСписка.Значение = Потребительская) Тогда
					
					Элементы.ОписаниеGTINВидУпаковки.СписокВыбора.Добавить(
						ЭлементСписка.Значение, ЭлементСписка.Представление);
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииНоменклатуры(
		ЭтотОбъект, ТекущиеДанные, КэшированныеЗначения, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СобытияФормИСКлиентПереопределяемый.ПриНачалеВыбораНоменклатуры(Элемент, ВидПродукции, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	СобытияФормИСКлиентПереопределяемый.ПриНачалеВыбораУпаковки(Элемент, ТекущиеДанные.Номенклатура, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINУпаковкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Номенклатура",       ТекущиеДанные.Номенклатура);
	ДанныеСтроки.Вставить("Упаковка",           ТекущиеДанные.Упаковка);
	ДанныеСтроки.Вставить("КоличествоУпаковок", 1);
	ДанныеСтроки.Вставить("Количество",         0);
	
	СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииКоличества(ЭтотОбъект, ДанныеСтроки, КэшированныеЗначения);
	
	ТекущиеДанные.Коэффициент = ДанныеСтроки.Количество;
	
	Если ТекущиеДанные.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская") Тогда
		ТекущиеДанные.КоличествоПотребительскихУпаковок = 1;
	Иначе
		ТекущиеДанные.КоличествоПотребительскихУпаковок = ТекущиеДанные.Коэффициент / ТекущиеДанные.КоличествоВПотребительскойУпаковке;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINХарактеристикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	
	СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииХарактеристики(ЭтотОбъект, ТекущиеДанные, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	СобытияФормИСМПКлиентПереопределяемый.ПриНачалеВыбораХарактеристики(
		Элемент, ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINСерияПриИзменении(Элемент)
	
	СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииСерии(
		ЭтотОбъект, Элементы.ОписаниеGTIN.ТекущиеДанные, КэшированныеЗначения, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнтеграцияИСКлиент.ОткрытьПодборСерий(ЭтотОбъект,, Элемент.ТекстРедактирования, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINВидУпаковкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская") Тогда
		ТекущиеДанные.КоличествоПотребительскихУпаковок = 1;
		КоличествоДоИзменения = ТекущиеДанные.КоличествоПотребительскихУпаковок;
	ИначеЕсли ТекущиеДанные.КоличествоПотребительскихУпаковок = 1
		И ЗначениеЗаполнено(ТекущиеДанные.ВидУпаковки) Тогда
		ТекущиеДанные.КоличествоПотребительскихУпаковок = 0;
		КоличествоДоИзменения = ТекущиеДанные.КоличествоПотребительскихУпаковок;
	ИначеЕсли ТекущиеДанные.КоличествоПотребительскихУпаковок > 0
		И Не ЗначениеЗаполнено(ТекущиеДанные.ВидУпаковки)
		И Не ЗначениеЗаполнено(ТекущиеДанные.Упаковка) Тогда
		ТекущиеДанные.КоличествоПотребительскихУпаковок = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	КоличествоДоИзменения = Элементы.ОписаниеGTIN.ТекущиеДанные.КоличествоПотребительскихУпаковок;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
		ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
		Если ТекущиеДанные.КоличествоПотребительскихУпаковок = 1
			И ЗначениеЗаполнено(ТекущиеДанные.ВидУпаковки)
			И ТекущиеДанные.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская") Тогда
			СписокДействий = Новый СписокЗначений;
			СписокДействий.Добавить("ПродолжитьВвод", "Продолжить ввод");
			СписокДействий.Добавить("ОтменитьВвод", "Отменить ввод");
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросИзменениеКоличества", ЭтотОбъект),
				НСтр("ru = 'Для указанного вида упаковки количество потребительских упаковок не может быть равно единице'"),
				СписокДействий);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINПриАктивизацииСтроки(Элемент)
	ИзменитьДоступностьКнопкиЗагрузки();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеGTINНоменклатураСервисаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ОписаниеGTIN.ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(Элементы.ОписаниеGTIN.ТекущиеДанные.ИдентификаторНоменклатуры) Тогда
		
		МодульРаботаСНоменклатуройКлиент().ОткрытьФормуКарточкиНоменклатуры(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
				Элементы.ОписаниеGTIN.ТекущиеДанные.ИдентификаторНоменклатуры),
			ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если Не ПроверитьЗаполнениеТаблицыФормы() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанные();
	
	Закрыть("УточненыКоэффициентыУпаковокИСМП");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	Если Элементы.ОписаниеGTIN.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыНоменклатуры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый Структура("ИдентификаторНоменклатуры, ИдентификаторХарактеристики", 
			ТекущиеДанные.ИдентификаторНоменклатуры, ТекущиеДанные.ИдентификаторХарактеристики));
	
	СоздатьНоменклатуруПоИдентификаторам(ИдентификаторыНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВсе(Команда)
	
	Если ОписаниеGTIN.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Идентификаторы = Новый Массив;
	
	Для каждого ЭлементКоллекции Из ОписаниеGTIN Цикл
		Если ЗначениеЗаполнено(ЭлементКоллекции.ИдентификаторНоменклатуры) 
			И НЕ ЗначениеЗаполнено(ЭлементКоллекции.Номенклатура) Тогда
			
			Идентификаторы.Добавить(Новый Структура("ИдентификаторНоменклатуры, ИдентификаторХарактеристики", 
				ЭлементКоллекции.ИдентификаторНоменклатуры, 
				ЭлементКоллекции.ИдентификаторХарактеристики));
		КонецЕсли;
	КонецЦикла;
	
	СоздатьНоменклатуруПоИдентификаторам(Идентификаторы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект, "ОписаниеGTINЕдиницаИзмерения", "ОписаниеGTIN.Упаковка");
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект, "ОписаниеGTINХарактеристика", "ОписаниеGTIN.ХарактеристикиИспользуются");
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтотОбъект, "ОписаниеGTINСерия", "ОписаниеGTIN.СтатусУказанияСерий", "ОписаниеGTIN.ТипНоменклатуры");
	
	ИнтеграцияИС1СНоменклатура.УстановитьУсловноеОформлениеПолей1СНоменклатура(ЭтотОбъект, "ОписаниеGTIN");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINНоменклатура.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINНоменклатура.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINПредставлениеСодержимоеУпаковки.ПутьКДанным));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINДоступноРедактированиеВидаУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УточнениеВидаУпаковки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок.Имя);
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаОтбора1_1 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1_1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора1_1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УточнениеВидаУпаковки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора1_1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора1_1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыУпаковокИС.Набор;
	
	ОтборЭлемента = ГруппаОтбора1_1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ГруппаОтбора1_2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1_2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора1_2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УточнениеВидаУпаковки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора1_2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыУпаковокИС.Набор;
	
	ОтборЭлемента = ГруппаОтбора1_2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок.Имя);
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINУпаковка.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыУпаковокИС.Потребительская;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыУпаковокИС.Набор;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Определяется вариантом комплектации'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	
	//
	СписокТабачнойПродукции = Новый СписокЗначений;
	ВидыПродукцииМОТП = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииМОТП();
	Для Каждого ЭлементСписка Из ВидыПродукцииМОТП Цикл
		СписокТабачнойПродукции.Добавить(ЭлементСписка);
	КонецЦикла;
	
	ЭлементыОформления = Новый Массив;
	
	ЭлементОформления = Новый Структура;
	ЭлементОформления.Вставить("ВидПродукции", Неопределено);
	ЭлементОформления.Вставить("ВидУпаковки",   Перечисления.ВидыУпаковокИС.Потребительская);
	ЭлементОформления.Вставить("Представление", НСтр("ru = 'Потребительская'"));
	ЭлементыОформления.Добавить(ЭлементОформления);
	
	ЭлементОформления = Новый Структура;
	ЭлементОформления.Вставить("ВидПродукции",  Неопределено);
	ЭлементОформления.Вставить("ВидУпаковки",   Перечисления.ВидыУпаковокИС.Логистическая);
	ЭлементОформления.Вставить("Представление", НСтр("ru = 'Логистическая'"));
	ЭлементыОформления.Добавить(ЭлементОформления);

	ЭлементОформления = Новый Структура;
	ЭлементОформления.Вставить("ВидПродукции",  Неопределено);
	ЭлементОформления.Вставить("ВидУпаковки",   Перечисления.ВидыУпаковокИС.Групповая);
	ЭлементОформления.Вставить("Представление", НСтр("ru = 'Групповая'"));
	ЭлементыОформления.Добавить(ЭлементОформления);
	
	ЗаполнитьЭлементыОформленияПоВидуУпаковок(ЭлементыОформления);
	
	Для Каждого ЭлементОформления Из ЭлементыОформления Цикл
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ОписаниеGTINВидУпаковки.ПутьКДанным);
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = ЭлементОформления.ВидУпаковки;
		
		Если ЭлементОформления.ВидПродукции <> Неопределено Тогда
			ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидПродукции");
			ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = ЭлементОформления.ВидПродукции;
		КонецЕсли;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементОформления.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыНаСервере()
	
	Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок.Видимость =
		УточнениеВидаУпаковки Или Не ТолькоПотребительскиеУпаковки;
	
	Элементы.ОписаниеGTINДанныеНоменклатуры.ТолькоПросмотр = УточнениеВидаУпаковки;
	
	Элементы.ОписаниеGTINВидУпаковки.КнопкаОчистки = УточнениеВидаУпаковки;
	
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект,   "ОписаниеGTINХарактеристика", "Элементы.ОписаниеGTIN.ТекущиеДанные.Номенклатура");
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект,   "ОписаниеGTINУпаковка",       "Элементы.ОписаниеGTIN.ТекущиеДанные.Номенклатура");
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект,   "ОписаниеGTINСерия",          "Элементы.ОписаниеGTIN.ТекущиеДанные.Номенклатура");
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСХарактеристикой(ЭтотОбъект, "ОписаниеGTINСерия",          "Элементы.ОписаниеGTIN.ТекущиеДанные.Характеристика");
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменениеКоличества(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ПродолжитьВвод" Тогда
		ТекущийЭлемент = Элементы.ОписаниеGTINКоличествоПотребительскихУпаковок;
		КоличествоНачальное = КоличествоДоИзменения;
		Элементы.ОписаниеGTIN.ИзменитьСтроку();
		КоличествоДоИзменения = КоличествоНачальное;
	Иначе
		Если КоличествоДоИзменения = 1 Тогда
			КоличествоДоИзменения = 0;
		КонецЕсли;
		ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
		ТекущиеДанные.КоличествоПотребительскихУпаковок = КоличествоДоИзменения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеТаблицыФормы()
	
	Отказ = Ложь;
	
	Для Каждого Строка Из ОписаниеGTIN Цикл
		
		Если Не УточнениеВидаУпаковки
			И Не ЗначениеЗаполнено(Строка.ВидУпаковки) Тогда
			
			Индекс = ОписаниеGTIN.Индекс(Строка) + 1;
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не заполнено поле ""Вид упаковки""'"),,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОписаниеGTIN", Индекс, "ВидУпаковки"),,
				Отказ);
			
		КонецЕсли;
			
		Если УточнениеВидаУпаковки
			И ЗначениеЗаполнено(Строка.ВидУпаковки)
			И Строка.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")
			И Не ЗначениеЗаполнено(Строка.КоличествоПотребительскихУпаковок)
			Или Не УточнениеВидаУпаковки
			И Строка.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")
			И Не ЗначениеЗаполнено(Строка.КоличествоПотребительскихУпаковок) Тогда
			
			Индекс = ОписаниеGTIN.Индекс(Строка) + 1;
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не заполнено поле ""Количество потребительских упаковок""'"),,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОписаниеGTIN", Индекс, "КоличествоПотребительскихУпаковок"),,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура СохранитьДанные()
	
	НачатьТранзакцию();
	
	Попытка
		
		ТаблицаОписанияGTIN = ОписаниеGTIN.Выгрузить();
		
		Отказ = Не РегистрыСведений.ОписаниеGTINИС.УстановитьОписаниеПоТаблице(ТаблицаОписанияGTIN);
		
		Если Отказ Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось установить описание GTIN'");
		КонецЕсли;
		
		КоличествоСтрок = ТаблицаОписанияGTIN.Количество();
		Для Счетчик = 1 По КоличествоСтрок Цикл
			Индекс = КоличествоСтрок - Счетчик;
			Если Не ЗначениеЗаполнено(ТаблицаОписанияGTIN[Индекс].Номенклатура) Тогда
				ТаблицаОписанияGTIN.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
		
		ПроверкаИПодборПродукцииИСМППереопределяемый.ЗафиксироватьОписаниеGTIN(ТаблицаОписанияGTIN);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеВидовУпаковокПоВидуПродукции(Форма, ВидПродукции)
	
	ПредставлениеВидовУпаковок = Новый Соответствие;
	
	Для Каждого ЭлементСписка Из Форма.ВидУпаковкиСписокВыбора Цикл
		
		ВидУпаковки = ЭлементСписка.Значение;
		
		ПредставлениеУпаковки = КонструкторИСМПОбщегоНазначенияКлиентСервер.ПредставлениеВидаУпаковкиПоВидуПродукции(
			ВидПродукции, ВидУпаковки);
		Если Не ЗначениеЗаполнено(ПредставлениеУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		ПредставлениеВидовУпаковок.Вставить(ВидУпаковки, ПредставлениеУпаковки);
		
	КонецЦикла;
	
	Возврат ПредставлениеВидовУпаковок;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьЭлементыОформленияПоВидуУпаковок(ЭлементыОформления)
	
	ЭлементКонструктора = ПредопределенноеЗначение("Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыУпаковок");
	
	ДанныеЭлемента = КонструкторИСОбщегоНазначенияКлиентСервер.ДанныеЭлементаКонструктора(ЭлементКонструктора);
	
	Для Каждого ТекущийВидПродукции Из ДанныеЭлемента.ВидыПродукции Цикл
	
		Для Каждого КлючИЗначение Из ТекущийВидПродукции.Значение Цикл
			
			ВидУпаковки = КлючИЗначение.Значение;	
			
			ПредставлениеУпаковки = КонструкторИСМПОбщегоНазначенияКлиентСервер.ПредставлениеВидаУпаковкиПоВидуПродукции(
				ТекущийВидПродукции, ВидУпаковки);
			
			Если Не ЗначениеЗаполнено(ПредставлениеУпаковки) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементОформления = Новый Структура;
			ЭлементОформления.Вставить("ВидПродукции",  ТекущийВидПродукции);
			ЭлементОформления.Вставить("ВидУпаковки",   ВидУпаковки);
			ЭлементОформления.Вставить("Представление", ПредставлениеУпаковки);
			
			ЭлементыОформления.Добавить(ЭлементОформления);
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#Область РаботаССервисом1СНоменклатура

&НаКлиенте
Функция МодульРаботаСНоменклатуройКлиент()
	
	Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСНоменклатуройКлиент");
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыСопоставлениеНоменклатурыПоДаннымСервисаПриСоздании()
	
	Элементы.ГруппаДекорацииДлительнойОперации.Видимость     = ИспользуетсяСервис1СНоменклатура;
	Элементы.ОписаниеGTINГруппаНоменклатураСервиса.Видимость = ИспользуетсяСервис1СНоменклатура;
	
	Если ИспользуетсяСервис1СНоменклатура Тогда
		
		ПравоИзмененияДанных = ИнтеграцияИС1СНоменклатура.МодульРаботаСНоменклатурой().ПравоИзмененияДанных();
		
		Элементы.ГруппаСоздатьНоменклатуруПоДаннымСервиса.Видимость = ПравоИзмененияДанных;
		Элементы.СоздатьВсе.Видимость = ПравоИзмененияДанных
			И ИнтеграцияИС1СНоменклатура.МодульРаботаСНоменклатурой().РазрешеноПакетноеСозданиеНоменклатуры();
		
	Иначе
 		Элементы.ГруппаСоздатьНоменклатуруПоДаннымСервиса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриДлительнойОперации(ЭтоНачалоДлительнойОперации, Режим)
	
	Если Режим = "Поиск" Тогда
		Элементы.НадписьДлительнойОперации.Заголовок = НСтр("ru = 'Поиск номенклатуры'");
		Элементы.ФормаГотово.Доступность = Истина;
	ИначеЕсли Режим = "Загрузка" Тогда	
		Элементы.НадписьДлительнойОперации.Заголовок = НСтр("ru = 'Загрузка номенклатуры'");
		Элементы.ФормаГотово.Доступность = Не ЭтоНачалоДлительнойОперации;
	КонецЕсли;
		
	Элементы.ГруппаДекорацииДлительнойОперации.Видимость          = ЭтоНачалоДлительнойОперации;
	Элементы.ГруппаСоздатьНоменклатуруПоДаннымСервиса.Доступность = Не ЭтоНачалоДлительнойОперации;
		
КонецПроцедуры

&НаКлиенте
Функция ШтрихкодыНоменклатурыКОпределению()
	
	Результат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ОписаниеGTIN Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторНоменклатуры) Тогда
			Результат.Добавить(РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(СтрокаТаблицы.GTIN));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьНоменклатуруПоШтрихкодамЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	РазобратьРезультатПоискаПоШтрихкоду(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНоменклатуруПоШтрихкодамВСервисе(Штрихкоды)
	
	НастроитьФормуПриДлительнойОперации(Истина, "Поиск");
	
	ПараметрыЗавершения = Новый Структура;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьНоменклатуруПоШтрихкодамЗавершение",
		ЭтотОбъект, ПараметрыЗавершения);
	
	МодульРаботаСНоменклатуройКлиент().ПолучитьНоменклатуруПоШтрихкодам(
		ОписаниеОповещения,
		Штрихкоды,
		ЭтотОбъект,
		ИдентификаторЗадания,
		Элементы.ГруппаДекорацииДлительнойОперации);
	
КонецПроцедуры
	
&НаСервере
Процедура РазобратьРезультатПоискаПоШтрихкоду(Результат)
	
	НастроитьФормуПриДлительнойОперации(Ложь, "Поиск");
	
	Если Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоШтрихкодам = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ТипЗнч(ДанныеПоШтрихкодам) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихкодыСервиса = ИнтеграцияИС1СНоменклатура.МодульРаботаСНоменклатурой().РазвернутыеДанныеПоШтрихкодам(ДанныеПоШтрихкодам);
	ПараметрыОтбора = Новый Структура("Штрихкод");
	
	Для Каждого ЭлементКоллекции Из ОписаниеGTIN Цикл
		
		ЭлементКоллекции.ПоискВСервисеВыполнен = Истина;
		
		Если ЗначениеЗаполнено(ЭлементКоллекции.ИдентификаторНоменклатуры) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора.Штрихкод = РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(ЭлементКоллекции.GTIN);
		СтрокиПоШтрихкоду = ШтрихкодыСервиса.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиПоШтрихкоду.Количество() = 0 Тогда
			ЭлементКоллекции.НоменклатураНайденаВСервисе = Ложь;
			Продолжить;
		КонецЕсли;
		
		ЭлементКоллекции.НоменклатураНайденаВСервисе = Истина;
		
		СтрокаДанных = СтрокиПоШтрихкоду[0];
		
		ЭлементКоллекции.НоменклатураСервиса         = СтрокаДанных.НаименованиеНоменклатурыПолное;
		ЭлементКоллекции.ИдентификаторНоменклатуры   = СтрокаДанных.ИдентификаторНоменклатуры;
		ЭлементКоллекции.ИдентификаторХарактеристики = СтрокаДанных.ИдентификаторХарактеристики;
		
	КонецЦикла;
	
	ИзменитьДоступностьКнопкиЗагрузитьВсе();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступностьКнопкиЗагрузитьВсе()
	
	ЕстьНоменклатураКСозданию = Ложь;
	
	Для каждого ЭлементКоллекции Из ОписаниеGTIN Цикл
		Если Не ЗначениеЗаполнено(ЭлементКоллекции.Номенклатура)
			И ЗначениеЗаполнено(ЭлементКоллекции.НоменклатураСервиса) Тогда
			
			ЕстьНоменклатураКСозданию = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СоздатьВсе.Доступность = ЕстьНоменклатураКСозданию 
		И Не Элементы.ГруппаДекорацииДлительнойОперации.Видимость;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьКнопкиЗагрузки()
	
	ТекущиеДанные = Элементы.ОписаниеGTIN.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Элементы.СоздатьНоменклатуру.Доступность = 
		ЗначениеЗаполнено(ТекущиеДанные.НоменклатураСервиса) 
			И НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура)
				И НЕ Элементы.ГруппаДекорацииДлительнойОперации.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуруПоИдентификаторам(ИдентификаторыНоменклатуры)
	
	НастроитьФормуПриДлительнойОперации(Истина, "Загрузка");	
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("ИдентификаторЗадания", Неопределено);
	
	СоздатьНоменклатуруПродолжение = Новый ОписаниеОповещения("СоздатьНоменклатуруПродолжение",
		ЭтотОбъект, ПараметрыЗавершения);
	
	МодульРаботаСНоменклатуройКлиент().ЗагрузитьНоменклатуруИХарактеристики(
		СоздатьНоменклатуруПродолжение, 
		ИдентификаторыНоменклатуры, 
		ЭтотОбъект, 
		Неопределено,
		Неопределено,
		Элементы.ГруппаДекорацииДлительнойОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуруПродолжение(Результат, ДополнительныеПараметры) Экспорт 
	
	НастроитьФормуПриДлительнойОперации(Ложь, "Загрузка");
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьНоменклатуру(Результат.НовыеЭлементы);
	
	ИзменитьДоступностьКнопкиЗагрузки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуру(СозданнаяНоменклатура)
	
	Модуль = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("РаботаСНоменклатуройПереопределяемый");
	
	Для Каждого ЭлементКоллекции Из СозданнаяНоменклатура Цикл
		
		СтрокиИдентификатору = ОписаниеGTIN.НайтиСтроки(
			Новый Структура("ИдентификаторНоменклатуры, ИдентификаторХарактеристики", 
				ЭлементКоллекции.ИдентификаторНоменклатуры, ЭлементКоллекции.ИдентификаторХарактеристики));
		
		Для Каждого СтрокаТаблицы Из СтрокиИдентификатору Цикл
			
			СтрокаТаблицы.Номенклатура = ЭлементКоллекции.Номенклатура;
			СтрокаТаблицы.Характеристика = ЭлементКоллекции.Характеристика;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Характеристика) Тогда
				СтрокаТаблицы.ХарактеристикиИспользуются = Истина;
			КонецЕсли;
			
			Модуль.ПоискНоменклатурыПоШтрихкодуПослеЗагрузкиНоменклатуры(СтрокаТаблицы, ЭлементКоллекции.Номенклатура);
			
			СтрокаТаблицы.КартинкаНоменклатураСервисаСопоставлена = 1;
			СтрокаТаблицы.НоменклатураНайденаВСервисе = Истина;
			
		КонецЦикла;
	
	КонецЦикла;
	
	ИзменитьДоступностьКнопкиЗагрузитьВсе();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточку1СНоменклатура(ТекущиеДанные)
	
	МодульРаботаСНоменклатуройКлиент().ОткрытьФормуКарточкиНоменклатуры(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			ТекущиеДанные.ИдентификаторНоменклатуры),
		ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
